In [1]:
import numpy as np
import pandas as pd

In [11]:
dtypes ={
    "Departman": ["IT","HR","Product","HR","IT","Marketing"],
    "Employee": ["Felix","Alexander","Julia","Friedrich","Emilie","Edward"],
    "Wage":[7000,5500,8500,7000,8000,7500]}

In [12]:
df = pd.DataFrame(dtypes)

In [13]:
df

   Departman   Employee  Wage
0         IT      Felix  7000
1         HR  Alexander  5500
2    Product      Julia  8500
3         HR  Friedrich  7000
4         IT     Emilie  8000
5  Marketing     Edward  7500

In [14]:
dGroup = df.groupby("Departman")

In [15]:
dGroup

In [16]:
dGroup.sum()

            Wage
Departman
HR         12500
IT         15000
Marketing   7500
Product     8500

In [17]:
df.groupby("Departman").sum()

            Wage
Departman
HR         12500
IT         15000
Marketing   7500
Product     8500

In [18]:
df.groupby("Departman").sum().loc["IT"]

Wage    15000
Name: IT, dtype: int64

In [19]:
int(df.groupby("Departman").sum().loc["IT"])

15000

In [20]:
df.groupby("Departman").count()

           Employee  Wage
Departman
HR                2     2
IT                2     2
Marketing         1     1
Product           1     1

In [21]:
df.groupby("Departman").max()

            Employee  Wage
Departman
HR         Friedrich  7000
IT             Felix  8000
Marketing     Edward  7500
Product        Julia  8500

In [22]:
df.groupby("Departman").min()

            Employee  Wage
Departman
HR         Alexander  5500
IT            Emilie  7000
Marketing     Edward  7500
Product        Julia  8500

In [23]:
df.groupby("Departman").min()["Wage"]

Departman
HR           5500
IT           7000
Marketing    7500
Product      8500
Name: Wage, dtype: int64

In [24]:
df.groupby("Departman").min()["Wage"]["IT"]

7000

In [25]:
df.groupby("Departman").mean()

           Wage
Departman
HR         6250
IT         7500
Marketing  7500
Product    8500

In [26]:
df.groupby("Departman").mean()["Wage"]["HR"]

6250